<html>
<body>

<p>&#x9AE;&#x9BE;&#x9B7;&#x9CD;&#x99F; &#x9B6;&#x9BF;&#x996;&#x9AC;&#x9C7; ES&#x9EC;, &#x98F;&#x995;&#x99F;&#x9BE; &#x99C;&#x9BE;&#x9AD;&#x9BE;&#x9B8;&#x9CD;&#x995;&#x9CD;&#x9B0;&#x9BF;&#x9AA;&#x9CD;&#x99F; &#x98F;&#x9B0; &#x9AB;&#x9BE;&#x987;&#x9B2; &#x996;&#x9C1;&#x9B2;&#x9C7; &#x9A8;&#x9BF;&#x99A;&#x9C7;&#x9B0; &#x99C;&#x9BF;&#x9A8;&#x9BF;&#x9B8;&#x997;&#x9C1;&#x9B2;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99F;&#x9BF;&#x9B8; &#x995;&#x9B0;&#x9C7; &#x9AB;&#x9C7;&#x9B2;&#x9CB;&#x964;&nbsp; </p>
<p><br /></p>
<p>&#x9E7;. &#x995;&#x996;&#x9A8; const &#x986;&#x9B0; &#x995;&#x996;&#x9A8; let &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AD;&#x9C7;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2; &#x9A1;&#x9BF;&#x995;&#x9CD;&#x9B2;&#x9C7;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9A4;&#x9C7; &#x9B9;&#x9DF; &#x9B8;&#x9C7;&#x99F;&#x9BE; &#x9A4;&#x9CB;&#x9AE;&#x9BE;&#x995;&#x9C7; &#x99C;&#x9BE;&#x9A8;&#x9A4;&#x9C7;&#x987; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9C1;&#x9AE;&#x9BF; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x9A8;&#x9BF;&#x99C;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BE; const &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BE; let &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AD;&#x9C7;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2; &#x9A1;&#x9BF;&#x995;&#x9CD;&#x9B2;&#x9C7;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x9AB;&#x9C7;&#x9B2;&#x9CB;&#x964;</p>
<p><br /></p>
<p>&#x9E8;. &#x99F;&#x9C7;&#x9AE;&#x9CD;&#x9AA;&#x9B2;&#x9C7;&#x99F; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BE; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982; &#x9A4;&#x9C8;&#x9B0;&#x9BF; &#x995;&#x9B0;&#x9CB;&#x964; &#x9B8;&#x9C7;&#x99F;&#x9BE;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x989;&#x9AA;&#x9B0;&#x9C7; &#x9A1;&#x9BF;&#x995;&#x9CD;&#x9B2;&#x9C7;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE; &#x9AD;&#x9C7;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2; &#x98F;&#x9B0; &#x9AE;&#x9BE;&#x9A8; &#x9A1;&#x9BE;&#x987;&#x9A8;&#x9BE;&#x9AE;&#x9BF;&#x995; &#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x9AC;&#x9B8;&#x9BE;&#x993;&#x964; &#x98F;&#x995;&#x987;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x989;&#x9AA;&#x9B0;&#x9C7; &#x98F;&#x995;&#x99F;&#x9BE; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A1;&#x9BF;&#x995;&#x9CD;&#x9B2;&#x9C7;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9CB;&#x964; &#x98F;&#x9AC;&#x982; &#x9A1;&#x9BE;&#x987;&#x9A8;&#x9BE;&#x9AE;&#x9BF;&#x995;&#x9AD;&#x9BE;&#x9AC;&#x9C7; &#x989;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x98F;&#x9B0; &#x9A6;&#x9C1;&#x987;&#x99F;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9AA;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9BF; &#x98F;&#x9B0; &#x9AE;&#x9BE;&#x9A8; &#x9A4;&#x9CB;&#x9AE;&#x9BE;&#x9B0; &#x99F;&#x9C7;&#x9AE;&#x9AA;&#x9CD;&#x9B2;&#x9C7;&#x99F; &#x9B8;&#x9CD;&#x99F;&#x9CD;&#x9B0;&#x9BF;&#x982; &#x98F;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x9AC;&#x9B8;&#x9BE;&#x993;&#x964; </p>
<p><br /></p>
<p>&#x9E9;.&#x9E7; &#x98F;&#x995;&#x99F;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x993;&#x9DF;&#x9BE;&#x9B2;&#x9BE; arrow &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9A1;&#x9BF;&#x995;&#x9CD;&#x9B2;&#x9C7;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9CB;&#x964; &#x98F;&#x9AC;&#x982; &#x9B8;&#x9C7;&#x987; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99C; &#x9B9;&#x9AC;&#x9C7; &#x9A4;&#x9C1;&#x9AE;&#x9BF; &#x995;&#x9CB;&#x9A8; &#x987;&#x9A8;&#x9AA;&#x9C1;&#x99F; &#x9A6;&#x9BF;&#x9B2;&#x9C7; &#x9B8;&#x9C7;&#x987; &#x987;&#x9A8;&#x9AA;&#x9C1;&#x99F; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;&#x995;&#x9C7; &#x9EB; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AD;&#x9BE;&#x997; &#x995;&#x9B0;&#x9C7; &#x986;&#x989;&#x99F;&#x9AA;&#x9C1;&#x99F; &#x9A6;&#x9BF;&#x9AC;&#x9C7;&#x964; </p>
<p><br /></p>
<p>&#x9E9;.&#x9E8; &#x9A4;&#x9C1;&#x9AE;&#x9BF; &#x9A6;&#x9C1;&#x987;&#x99F;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x993;&#x9DF;&#x9BE;&#x9B2;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9CB; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x964; &#x9B8;&#x9C7;&#x987; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x9AD;&#x9BF;&#x9A4;&#x9B0;&#x9C7; &#x995;&#x9BE;&#x99C; &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9CD;&#x9AF;&#x9C7;&#x995;&#x99F;&#x9BE; &#x987;&#x9A8;&#x9AA;&#x9C1;&#x99F; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x98F;&#x9B0; &#x9B8;&#x9BE;&#x9A5;&#x9C7; &#x9E8; &#x9AF;&#x9CB;&#x997; &#x995;&#x9B0;&#x9AC;&#x9C7; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0; &#x9AF;&#x9CB;&#x997;&#x9AB;&#x9B2; &#x9A6;&#x9C1;&#x987;&#x99F;&#x9BE; &#x997;&#x9C1;&#x9A3; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x964; &#x995;&#x9CD;&#x9AF;&#x9BE;&#x9AE;&#x9A8;&#x9C7; &#x995;&#x9B0;&#x9AC;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BE; &#x99A;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9BE; &#x995;&#x9B0;&#x9C7; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9CB; </p>
<p><br /></p>
<p>&#x9E9;.&#x9E9; &#x98F;&#x987;&#x9AC;&#x9BE;&#x9B0; &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x993;&#x9DF;&#x9BE;&#x9B2;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9CB; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9A1;&#x9BF;&#x995;&#x9CD;&#x9B2;&#x9C7;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9CB;&#x964; &#x9AF;&#x9C7;&#x987; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99C; &#x9B9;&#x9AC;&#x9C7; &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x9B8;&#x9C7;&#x987; &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0;&#x995;&#x9C7; &#x997;&#x9C1;&#x9A3; &#x995;&#x9B0;&#x9C7; &#x9B8;&#x9C7;&#x987; &#x9B0;&#x9C7;&#x99C;&#x9BE;&#x9B2;&#x9CD;&#x99F; &#x9B0;&#x9BF;&#x99F;&#x9BE;&#x9B0;&#x9CD;&#x9A8; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x964; </p>
<p><br /></p>
<p>&#x9E9;.&#x9EA; &#x98F;&#x987;&#x9AC;&#x9BE;&#x9B0; &#x9A6;&#x9C1;&#x987;&#x99F;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x993;&#x9DF;&#x9BE;&#x9B2;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BE; &#x985;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9CB; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9A8;&#x9BF;&#x9AC;&#x9C7;&#x964; &#x993;&#x987; arrow &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x99F;&#x9BE; &#x9B9;&#x9AC;&#x9C7; &#x985;&#x9A8;&#x9C7;&#x995;&#x997;&#x9C1;&#x9B2;&#x9BE; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7;&#x9B0;&#x964; &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9CD;&#x9AF;&#x9C7;&#x995;&#x99F;&#x9BE; &#x987;&#x9A8;&#x9AA;&#x9C1;&#x99F; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x98F;&#x9B0; &#x9B8;&#x9BE;&#x9A5;&#x9C7; &#x9E8; &#x9AF;&#x9CB;&#x997; &#x995;&#x9B0;&#x9AC;&#x9C7; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0; &#x9AF;&#x9CB;&#x997;&#x9AB;&#x9B2; &#x9A6;&#x9C1;&#x987;&#x99F;&#x9BE; &#x997;&#x9C1;&#x9A3; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x964; &#x995;&#x9CD;&#x9AF;&#x9BE;&#x9AE;&#x9A8;&#x9C7; &#x995;&#x9B0;&#x9AC;&#x9C7; &#x9B8;&#x9C7;&#x99F;&#x9BE; &#x99A;&#x9BF;&#x9A8;&#x9CD;&#x9A4;&#x9BE; &#x995;&#x9B0;&#x9C7; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9CB;&#x964; </p>
<p><br /></p>
<p>&#x9EA;. [&#x9B9;&#x9CB;&#x9AE; &#x993;&#x9DF;&#x9BE;&#x9B0;&#x9CD;&#x995;] &#x98F;&#x995;&#x99F;&#x9C1; &#x997;&#x9C1;&#x997;&#x9B2;&#x9C7; &#x9B8;&#x9BE;&#x9B0;&#x9CD;&#x99A; &#x9A6;&#x9BE;&#x993;: javascript function declaration vs arrow function &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0; &#x995;&#x9DF;&#x9C7;&#x995;&#x99F;&#x9BE; &#x986;&#x9B0;&#x9CD;&#x99F;&#x9BF;&#x995;&#x9C7;&#x9B2; &#x9AA;&#x9DC;&#x9C7; &#x9AC;&#x9C1;&#x99D;&#x9BE;&#x9B0; &#x99A;&#x9C7;&#x9B7;&#x9CD;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9CB;&#x964; </p>
<p>&#x9EA;.&#x9EB;. [&#x98F;&#x995;&#x9CD;&#x9B8;&#x99F;&#x9CD;&#x9B0;&#x9BE; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BE; &#x9B9;&#x9CB;&#x9AE; &#x993;&#x9DF;&#x9BE;&#x9B0;&#x9CD;&#x995;&#x964; &#x98F;&#x987;&#x99F;&#x9BE; &#x9AD;&#x9BF;&#x9A1;&#x9BF;&#x993;&#x9A4;&#x9C7; &#x9AC;&#x9B2;&#x9BE; &#x9A8;&#x9BE;&#x987;]: &#x99C;&#x9BE;&#x9AD;&#x9BE;&#x9B8;&#x9CD;&#x995;&#x9CD;&#x9B0;&#x9BF;&#x9AA;&#x9CD;&#x99F; &#x98F;&#x9B0; var, let, const &#x98F;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9BE;&#x9B0;&#x9CD;&#x9A5;&#x995;&#x9CD;&#x9AF; &#x995;&#x9BF;? </p>
<p> </p>
<p>&#x9EB;. &#x985;&#x9A8;&#x9C7;&#x995;&#x997;&#x9C1;&#x9B2;&#x9BE; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BE; array &#x9B9;&#x9AC;&#x9C7;&#x964; &#x9A4;&#x9BE;&#x9B0;&#x9AA;&#x9B0; &#x9A4;&#x9CB;&#x9AE;&#x9BE;&#x9B0; &#x995;&#x9BE;&#x99C; &#x9B9;&#x9AC;&#x9C7; array &#x98F;&#x9B0; &#x989;&#x9AA;&#x9B0;&#x9C7; map &#x987;&#x989;&#x99C; &#x995;&#x9B0;&#x9C7;&#x964; &#x9AA;&#x9CD;&#x9B0;&#x9A4;&#x9CD;&#x9AF;&#x9C7;&#x995;&#x99F;&#x9BE; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8;&#x995;&#x9C7; &#x9EB; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x997;&#x9C1;&#x9A8;&#x9CD; &#x995;&#x9B0;&#x9C7; &#x997;&#x9C1;&#x9A8;&#x9AB;&#x9B2; &#x986;&#x9B0;&#x9C7;&#x995;&#x99F;&#x9BE; array &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; &#x9B0;&#x9BE;&#x996;&#x9AC;&#x9C7;&#x964; &#x9AA;&#x9C1;&#x9B0;&#x9BE; &#x995;&#x9BE;&#x99C;&#x99F;&#x9BE; &#x98F;&#x995; &#x9B2;&#x9BE;&#x987;&#x9A8;&#x9C7; &#x9B9;&#x9AC;&#x9C7;&#x964; </p>
<p><br /></p>
<p>&#x9EC;. [ &#x99A;&#x9CD;&#x9AF;&#x9BE;&#x9B2;&#x9C7;&#x99E;&#x9CD;&#x99C;&#x9BF;&#x982;&#x964; &#x997;&#x9C1;&#x997;&#x9B2;&#x9C7; &#x9B8;&#x9BE;&#x9B0;&#x9CD;&#x99A; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9CB; ] &#x985;&#x9A8;&#x9C7;&#x995;&#x997;&#x9C1;&#x9B2;&#x9BE; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BE; array &#x9A5;&#x9C7;&#x995;&#x9C7; &#x9B6;&#x9C1;&#x9A7;&#x9C1; &#x9AC;&#x9BF;&#x99C;&#x9CB;&#x9DC; &#x9B8;&#x982;&#x996;&#x9CD;&#x9AF;&#x9BE; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9C7; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x986;&#x9B8;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; filter &#x987;&#x989;&#x99C; &#x995;&#x9B0;&#x9CB; </p>
<p><br /></p>
<p>&#x9ED;. &#x98F;&#x995;&#x99F;&#x9BE; array &#x98F;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7; &#x985;&#x9A8;&#x9C7;&#x995;&#x997;&#x9C1;&#x9B2;&#x9BE; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x986;&#x99B;&#x9C7;&#x964; &#x9B8;&#x9C7;&#x996;&#x9BE;&#x9A8;&#x9C7; &#x9AF;&#x9C7;&#x987; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x98F;&#x9B0; price &#x986;&#x99B;&#x9C7; &#x9EB;&#x9E6;&#x9E6;&#x9E6; &#x99F;&#x9C7;&#x995;&#x9CD;&#x995;&#x9BE; &#x9B8;&#x9C7;&#x987; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F;&#x995;&#x9C7; find &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AC;&#x9C7;&#x9B0; &#x995;&#x9B0;&#x9CB;&#x964; </p>
<p><br /></p>
<p>&#x9ED;.&#x9EB; [&#x98F;&#x995;&#x9CD;&#x9B8;&#x99F;&#x9CD;&#x9B0;&#x9BE;] &#x99C;&#x9BE;&#x9AD;&#x9BE;&#x9B8;&#x9CD;&#x995;&#x9CD;&#x9B0;&#x9BF;&#x9AA;&#x9CD;&#x99F; &#x98F; array &#x98F;&#x9B0; map, forEach, filter, find &#x995;&#x9CB;&#x9A8;&#x99F;&#x9BE; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x995;&#x9BF; &#x9B9;&#x9DF;&#x964; &#x9B8;&#x9C7;&#x99F;&#x9BE;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BE; &#x9B8;&#x9BE;&#x9AE;&#x9BE;&#x9B0;&#x9BF; &#x9B2;&#x9BF;&#x996;&#x9C7; &#x9AB;&#x9C7;&#x9B2;&#x9CB;&#x964; </p>
<p><br /></p>
<p>&#x9EE;. &#x9B8;&#x9BF;&#x9AE;&#x9CD;&#x9AA;&#x9B2; &#x98F;&#x995;&#x99F;&#x9BE; &#x99C;&#x9BE;&#x9AD;&#x9BE;&#x9B8;&#x9CD;&#x995;&#x9CD;&#x9B0;&#x9BF;&#x9AA;&#x9CD;&#x99F; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x98F;&#x9B0; &#x995;&#x9CB;&#x9A8; &#x98F;&#x995;&#x99F;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9CB;&#x9AA;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9BF;&#x995;&#x9C7; &#x9AD;&#x9C7;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2; &#x9B9;&#x9BF;&#x9B8;&#x9C7;&#x9AC;&#x9C7; &#x9A1;&#x9BF;&#x995;&#x9CD;&#x9B2;&#x9C7;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; destructuring &#x987;&#x989;&#x99C; &#x995;&#x9B0;&#x9CB;&#x964; </p>
<p><br /></p>
<p>&#x9EF;. [&#x99A;&#x9CD;&#x9AF;&#x9BE;&#x9B2;&#x9C7;&#x99E;&#x9CD;&#x99C;&#x9BF;&#x982;] array &#x98F;&#x9B0; destructuring &#x995;&#x9B0;&#x9AC;&#x9C7;&nbsp;&#x986;&#x9B0; &#x9B8;&#x9C7;&#x99F;&#x9BE; &#x995;&#x9B0;&#x9BE;&#x9B0; &#x99C;&#x9A8;&#x9CD;&#x9AF; &#x9A4;&#x9C1;&#x9AE;&#x9BF; &#x98F;&#x9B0;&#x9C7; &#x98F;&#x9B0; &#x9A5;&#x9BE;&#x9B0;&#x9CD;&#x9A1; &#x9AA;&#x99C;&#x9BF;&#x9B6;&#x9A8; &#x98F;&#x9B0; &#x989;&#x9AA;&#x9BE;&#x9A6;&#x9BE;&#x9A8; &#x995;&#x9C7; destructuring &#x995;&#x9B0;&#x9C7; &apos;three&apos; &#x9A8;&#x9BE;&#x9AE;&#x995; &#x98F;&#x995;&#x99F;&#x9BE; &#x9AD;&#x9C7;&#x9B0;&#x9BF;&#x9DF;&#x9C7;&#x9AC;&#x9B2; &#x98F; &#x9B0;&#x9BE;&#x996;&#x9AC;&#x9C7;&#x964; </p>
<p><br /></p>
<p>&#x9E7;&#x9E6;. &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x993;&#x9DF;&#x9BE;&#x9B2;&#x9BE; &#x98F;&#x995;&#x99F;&#x9BE; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8; &#x9B2;&#x9BF;&#x996;&#x9AC;&#x9C7;&#x964; &#x9AF;&#x9C7;&#x987; &#x9AB;&#x9BE;&#x982;&#x9B6;&#x9A8;&#x9C7;&#x9B0; &#x995;&#x9BE;&#x99C; &#x9B9;&#x9AC;&#x9C7; &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x9A8;&#x9BF;&#x9DF;&#x9C7; &#x9B8;&#x9C7;&#x987; &#x9A4;&#x9BF;&#x9A8;&#x99F;&#x9BE; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x98F;&#x9B0; &#x9AF;&#x9CB;&#x997; &#x995;&#x9B0;&#x9C7;&nbsp;&#x9AF;&#x9CB;&#x997;&#x9AB;&#x9B2; &#x9B0;&#x9BF;&#x99F;&#x9BE;&#x9B0;&#x9CD;&#x9A8; &#x995;&#x9B0;&#x9AC;&#x9C7;&#x964; &#x986;&#x9B0; &#x9A5;&#x9BE;&#x9B0;&#x9CD;&#x9A1; &#x9AA;&#x9CD;&#x9AF;&#x9BE;&#x9B0;&#x9BE;&#x9AE;&#x9BF;&#x99F;&#x9BE;&#x9B0; &#x98F;&#x9B0; &#x98F;&#x995;&#x99F;&#x9BE; &#x9A1;&#x9BF;&#x9AB;&#x9B2;&#x9CD;&#x99F; &#x9AD;&#x9CD;&#x9AF;&#x9BE;&#x9B2;&#x9C1; &#x9A5;&#x9BE;&#x995;&#x9AC;&#x9C7;&#x964; &#x9B8;&#x9C7;&#x99F;&#x9BE; &#x9B9;&#x9AC;&#x9C7; &#x9ED;&#x964; </p>
<p><br /></p>
<p><br /></p>
<p>[&#x985;&#x9AA;&#x9B6;&#x9A8;&#x9BE;&#x9B2;]</p>
<p><br /></p>
<p>&#x9E7;&#x9E7;. &#x98F;&#x995;&#x99F;&#x9BE; nested &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A1;&#x9BF;&#x995;&#x9CD;&#x9B2;&#x9C7;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9CB; (&#x985;&#x9B0;&#x9CD;&#x9A5;&#x9BE;&#x9CE; &#x98F;&#x995;&#x99F;&#x9BE; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x98F;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9AA;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9BF; &#x98F;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7;&#x993; &#x9AF;&#x9C7; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A5;&#x9BE;&#x995;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x964; &#x986;&#x9AC;&#x9BE;&#x9B0; &#x9B8;&#x9C7;&#x987; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x98F;&#x9B0; &#x9AA;&#x9CD;&#x9B0;&#x9AA;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9BF; &#x98F;&#x9B0; &#x9AE;&#x9A7;&#x9CD;&#x9AF;&#x9C7;&#x993; &#x9B8;&#x9C7; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A5;&#x9BE;&#x995;&#x9A4;&#x9C7; &#x9AA;&#x9BE;&#x9B0;&#x9C7;&#x964; &#x9B8;&#x9C7;&#x987; &#x9B0;&#x995;&#x9AE; &#x98F;&#x995;&#x99F;&#x9BE; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x9A1;&#x9BF;&#x995;&#x9CD;&#x9B2;&#x9C7;&#x9DF;&#x9BE;&#x9B0; &#x995;&#x9B0;&#x9CB;&#x964; &#x98F;&#x9AC;&#x982; &#x9AF;&#x9C7;&#x995;&#x9CB;&#x9A8; &#x98F;&#x995;&#x99F;&#x9BE; &#x9AA;&#x9CD;&#x9B0;&#x9AA;&#x9BE;&#x9B0;&#x9CD;&#x99F;&#x9BF; &#x98F;&#x9B0; &#x9AE;&#x9BE;&#x9A8; &#x98F;&#x995;&#x99F;&#x9BE; array &#x9B9;&#x9AC;&#x9C7;&#x964; &#x99C;&#x9BE;&#x9B8;&#x9CD;&#x99F; &#x98F;&#x9AE;&#x9A8; &#x98F;&#x995;&#x99F;&#x9BE; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; )</p>
<p><br /></p>
<p>&#x9E7;&#x9E8;. &#x989;&#x9AA;&#x9B0;&#x9C7;&#x9B0; &#x985;&#x9AC;&#x99C;&#x9C7;&#x995;&#x9CD;&#x99F; &#x98F; &#x9A1;&#x99F; &#x98F;&#x9B0; &#x986;&#x997;&#x9C7; &#x9AF;&#x9C7; &#x9AA;&#x9CD;&#x9B0;&#x9B6;&#x9CD;&#x9A8;&#x9AC;&#x9CB;&#x9A7;&#x995; &#x99A;&#x9BF;&#x9B9;&#x9CD;&#x9A8; &#x9A6;&#x9BF;&#x9DF;&#x9C7; &#x9AF;&#x9C7; &#x985;&#x9AA;&#x9B6;&#x9A8;&#x9BE;&#x9B2; &#x99A;&#x9C7;&#x987;&#x9A8;&#x9BF;&#x982; &#x995;&#x9B0;&#x9BE; &#x9AF;&#x9BE;&#x9DF;&#x964; &#x9B8;&#x9C7;&#x99F;&#x9BE; &#x98F;&#x995;&#x99F;&#x9C1; &#x9AA;&#x9CD;&#x9B0;&#x9BE;&#x995;&#x99F;&#x9BF;&#x9B8; &#x995;&#x9B0;&#x9CB;&#x964; </p> </body>
</html>